# Шаг 1: Сборка приложения
# Используем официальный образ Golang как сборщик.
# Alpine - легковесный дистрибутив Linux.
FROM golang:1.21-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы управления зависимостями
COPY go.mod go.sum ./
# Скачиваем зависимости
RUN go mod download

# Копируем весь исходный код проекта
COPY . .

# Собираем статически скомпилированный бинарный файл для Linux.
# Это позволяет запускать его в минималистичном образе без системных зависимостей.
RUN CGO_ENABLED=0 GOOS=linux go build -a -installsuffix cgo -o etalon-server ./cmd/etalon-server

# Шаг 2: Создание минимального образа для запуска
# Используем самый базовый образ Alpine.
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем только скомпилированный бинарник из стадии сборки
COPY --from=builder /app/etalon-server .

# Сообщаем Docker, что контейнер будет слушать порт 8080
EXPOSE 8080

# Команда по умолчанию для запуска приложения при старте контейнера
CMD ["./etalon-server"]